README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Nuclear &amp; Particle Physics classes of Master 1 - README</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Xavier Garrido" />
<link rel="stylesheet" href="css/styles.css">
               <link rel="stylesheet" href="css/org-pygments.css">
               <link rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css">
</head>
<body onload="displayTOC()"><div id="toc"></div>
<div id="content">
<h1 class="title">Nuclear &amp; Particle Physics classes of Master 1 - README</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This repository contains materials for Nuclear &amp; Particle Physics classes given
in Master 1 of Fundamental Physics at the University of Paris Sud.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Installation</h2>
<div class="outline-text-2" id="text-2">
<p>
You will need special <code>orgmode</code> settings to translate the <code>org</code> files into <code>pdf</code>
documents. All the needed code is embedded within this file in the next
sections. Nevertheless, you will need to install some <a href="https://github.com/xgarrido/latex-templates">latex-templates</a> specially
developed for such purpose.
</p>

<p>
Moreover, to avoid duplication of <code>org-mode</code> LaTeX class, <a href="https://github.com/xgarrido/zsh-org-pages">org-pages</a> script is
used to produce <code>pdf</code> file as well as <code>html</code> (if needed). It adds another
dependency but it eases the unification of org export for several file sources.
</p>

<p>
There is no need to detangle this file since emacs will do it when you
will use the Makefile in the corresponding directories. So, next step will be to
do <code>make</code> within the different directories.
</p>


<div class="center">
<p>
See <a href="./td_np.html">Nuclear &amp; Particle Physics classes</a> (in french)
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
File under git version control - commit 5330ef4 - 2014-03-08
</div>
</body>
</html>
